/*
🔶 Type Guard কী?

Type Guard হলো এমন একটি শর্ত বা ফাংশন, যা প্রমাণ করে ‍— “এই ভ্যালুটি আসলে কোন টাইপের।”

এতে TypeScript বুঝতে পারে কোন ব্লকের ভেতরে কোন টাইপ ব্যবহার হচ্ছে।
typeof সাধারণত primitive টাইপ (string, number, boolean ইত্যাদি) চেক করতে ব্যবহৃত হয়।
*/


// ====================================================================================================


type Alphanumaric = string | number;

const add=(num1:Alphanumaric,num2:Alphanumaric)=>{
    // num1+num2;
    
    /*Uasing Type Guard*/
    if(typeof num1 === "number" && typeof num2 === "number"){
        return num1+num2;
    }else{
        num1.toString()+num2.toString();
    }
}

add(2,2);
add(2,"2");
add("2",2);
add("2","2");


// ================================================

// in guard

/*
✅ 2. in অপারেটর ব্যবহার করে Type Guard
👉 কখন ব্যবহার করবেন?

যখন আপনার দুই বা তার বেশি object টাইপ আছে এবং কোনটিতে কোন প্রপার্টি আছে তা দেখে টাইপ আলাদা করতে চান।
*/

type User ={
    name:string;
};

type AdminUser ={
    name:string;
    digits:number;
};

const getUserInfo=(user:User | AdminUser)=>{
    if("digits" in user){
        console.log(`${user.name} and his account number is :${user.digits}`)
    }else{
        console.log(`${user.name}`);
    }
}

getUserInfo({name:"Shahid",digits:13152478965});